Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnBaseAboveTopFailure Property
 The column base can't be moved above its top.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnBaseAboveTopFailure { get; }
Public Shared ReadOnly Property ColumnBaseAboveTopFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnBaseAboveTopFailure {
	FailureDefinitionId^ get ();
}
static member ColumnBaseAboveTopFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace